# . Да се напише програма, която да създаде следният шаблон:
# *
# * *
# * * *
# * * * *
# * * * * *
# * * * *
# * * *
# * *
# *

""" print("\n")
print("Задача №3")
print("\n")

#~ Горна половина на шаблона
for i in range(1, 6):
    print('* ' * i)

#~ Долна половина на шаблона
for i in range(4, 0, -1):
    print('* ' * i)

print('\n'*2)
print("*"*30)
print('\n') """

middle = 5
top = 3 #~ горен ред на буквата
rows = 2 * middle - 3 - top

for row in range(rows):
    if row == 0:  # ~ първи ред от буквата
        print(" ", "*"*3, sep="") #~ принтира първия ред със спейс, 3 звезди, спейс.
    else:
        print('*',' '*top, '*', sep='')
